"use strict"
// Задача №1
// Що потрапить в консоль?

// let someVar = 0;
// ++someVar;

// if (someVar) {
// 	console.log(someVar);
// }
// Відповідь:
// 1. Спочтаку ми призначаємо нашій зміній значення
// 2. Далі ми збільшуємо нашу зміну на один задопомогою інкременту
// 3. Якщо змінна someVar, то покажи в консолі значення someVar
// 4. В console.log буде 1

// Задача №2
// За допомогою циклу FOR виведіть в консоль 10 рядків:
// Пункт №1
// Пункт №2
// і т.д.
// Відповідь:
// for (let i = 1; i <= 10; ++i) {
//     console.log(`Пункт №${i}`);
// }

// Задача №3
// Що потрапить в консоль ?
// if (2 * 20 <= 10 || 30 / 2 < 5 && 10 <= "10" || 20 === "20") {
// 	console.log('000');
// }
// Відповідь:
// 1. Спочатку застосують математичні оператори:
// if (40 <= 10 || 15 < 5 && 10 <= "10" || 20 === "20")
// 2. Застосовуємо оператори порівняння: 
// if (false || false && true || false)
// 3. Потім застосовуємо логічний оператор &&:
// if (false || false || false)
// 4. Далі застосовуємо логічний оператор ||:
// if (false)
// 5. У консоль нічого не попаде із-за того що умова провалилась


// Задача №4
// Створіть функцію, яка повертає результат ділення числа a на число b з додаванням рядка "Результат ділення: "
// Викличте функцію передаючі різні значення, у тому числі не передаючи зовсім.
// Функція не має повертати NaN, Infinite або помилку 
function calcDivision(a, b) {
    const result = a / b;
    if (isNaN(result)) {
        console.log('Помилка, результат є не числом');
    }else if (!isFinite(result)) {
        console.log('Помилка, не є скінченним числом');
    }else if (b === 0) {
        console.log('Помилка. На нуль не можна ділити');
    } else {
        console.log(`Результат ділення: ${result}`);
    }
}
calcDivision(6, 3)
calcDivision(6, "dd")
calcDivision(Infinity, 3)

// Задача №5
// Створіть масив даних - 5 елементів, один з яких число 10
// Обробіть масив за допомогою методу перебору
// Перевіряйте елемент на відповідність числу 10, та у разі відповідності, виводьте в консоль

const myArray = ["Помилка", "Ділення", 10, "Hello", 6, false]
myArray.forEach(element => {
    if(element === 10) {
        console.log(element);
    }
});